app/views/indices/_explanation.html.erb

SELECT `pictures`.* FROM `pictures` WHERE `pictures`.`index_id` = 302  ORDER BY `pictures`.`id` DESC
---
            <td data-label="枚数">
              <% if index.pictures.count != 0 %>