app/views/indices/index_csv.html.erb

            <td data-label="枚数">
              <% if index.pictures.count != 0 %>
---
SELECT `pictures`.* FROM `pictures` WHERE `pictures`.`index_id` IN (300, 301, 302, 303, 304, 305, 306)