app/views/indices/index.html.erb

SELECT COUNT(*) FROM `pictures` WHERE `pictures`.`index_id` = 300
SELECT `pictures`.* FROM `pictures` WHERE `pictures`.`index_id` IN (300, 301, 302, 303, 304, 305, 306)
---
              <td data-label="総数">
                <% if index.pictures.count != 0 %>