app/controllers/indices_controller.rb

SELECT `pictures`.* FROM `pictures` WHERE `pictures`.`index_id` IN (300, 301, 302, 303, 304, 305, 306)
---
  def index
    @user = params[:user_id]
    @indices = Index.includes(user: :pictures).where("user_id=?", @user.to_i)

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 59  ORDER BY `users`.`id` ASC LIMIT 1
---
  def downloads
    @user = params[:user_id]
    @user_account = User.find(@user)

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 59  ORDER BY `users`.`id` ASC LIMIT 1
---
  def download
    @index = params['id']
    @user = params['user_id']
    @user_account = User.find(@user)

SELECT `pictures`.* FROM `pictures` WHERE `pictures`.`index_id` IN (300, 301, 302, 303, 304, 305, 306)
---
  def index_csv
    @playground = params[:playground]
    @parkname = params[:parkname]
    @user = params[:user_id]
    gon.user_id = @user # jsにuser_idを渡す
    @indices_csv = Index.includes(user: :pictures).where("user_id=?", @user.to_i)